import java.util.Random;

public class Main {
    public static void main(String[] args) {

        Random random = new Random();
        int size;
        int min, max;
        int positive, negative;
        int counter;

//## УРОВЕНЬ 1: ОЧЕНЬ ЛЕГКИЕ (Базовые операции)

//Задание 1
//Заполнить массив из 15 элементов случайными числами от -50 до 50 и вывести его на экран.
        size = 15;
        System.out.println(" 1 ");

        int[] m1 = new int[size];
        for (int i = 0; i < m1.length; i++) {
            m1[i] = random.nextInt(-50, 50 + 1);
        }

        for (int i = 0; i < m1.length; i++) {
            System.out.print(m1[i] + " ");
        }


//Задание 2
//Создать массив из 12 случайных чисел от -30 до 30 и найти длину этого массива.
        System.out.println("\n\n 2");

        size = 12;
        int[] m2 = new int[size];
        for (int i = 0; i < m2.length; i++) {
            m2[i] = random.nextInt(-30, 30 + 1);
        }

        System.out.print(m2.length);


//Задание 3
//Заполнить массив из 10 случайных чисел от -40 до 40 и вывести первый элемент массива.
        System.out.println("\n\n 3");

        size = 10;
        int[] m3 = new int[size];
        for (int i = 0; i < m3.length; i++) {
            m3[i] = random.nextInt(-40, 40 + 1);
        }

        System.out.print(m3[1]);


//Задание 4
//Создать массив из 14 случайных чисел от -25 до 25 и вывести последний элемент массива.

        System.out.println("\n\n 4");

        size = 14;
        int[] m4 = new int[size];
        for (int i = 0; i < m4.length; i++) {
            m4[i] = random.nextInt(-25, 25 + 1);
        }

        System.out.print(m4[m4.length - 1]);

//Задание 5
//Заполнить массив из 10 случайных чисел от -15 до 15 и найти сумму всех элементов массива.
        System.out.println("\n\n 5");

        size = 10;
        int sum = 0;
        int[] m5 = new int[size];
        for (int i = 0; i < m5.length; i++) {
            m5[i] = random.nextInt(-15, 15 + 1);
            sum = sum + m5[i];
        }

        System.out.print(sum);

//## УРОВЕНЬ 2: ЛЕГКИЕ (Подсчет элементов)

//Задание 6
//Создать массив из 20 случайных чисел от -30 до 30 и подсчитать, сколько в нем положительных чисел.
        System.out.println("\n\n 6");

        sum = 0;
        size = 20;
        int[] m6 = new int[size];
        for (int i = 0; i < m6.length; i++) {
            m6[i] = random.nextInt(-30, 30 + 1);
            if (m6[i] > 0) {
                sum++;
            }
        }

        System.out.print(sum);

//Задание 7
//Заполнить массив из 18 случайных чисел от -40 до 40 и подсчитать количество отрицательных чисел.
        System.out.println("\n\n 7");

        sum = 0;
        size = 18;
        int[] m7 = new int[size];
        for (int i = 0; i < m7.length; i++) {
            m7[i] = random.nextInt(-40, 40 + 1);
            if (m7[i] < 0) {
                sum++;
            }
        }

        System.out.print(sum);

//Задание 8
//Содать массив из 16 случайных чисел от -25 до 25 и подсчитать, сколько в нем четных чисел.
        System.out.println("\n\n 8");

        sum = 0;
        size = 16;
        int[] m8 = new int[size];
        for (int i = 0; i < m8.length; i++) {
            m8[i] = random.nextInt(-25, 25 + 1);
            if (m8[i] % 2 == 0) {
                sum++;
            }
        }

        System.out.print(sum);


//Задание 9
//Заполнить массив из 14 случайных чисел от -35 до 35 и подсчитать количество нечетных чисел.
        System.out.println("\n\n 9");

        sum = 0;
        size = 14;
        int[] m9 = new int[size];
        for (int i = 0; i < m9.length; i++) {
            m9[i] = random.nextInt(-35, 35 + 1);
            if (m9[i] % 2 != 0) {
                sum++;
            }
        }

        System.out.print(sum);


//Задание 10
//Создать массив из 25 случайных чисел от -10 до 10 и подсчитать, сколько в нем нулей.
        System.out.println("\n\n 10");

        sum = 0;
        size = 25;
        int[] m10 = new int[size];
        for (int i = 0; i < m10.length; i++) {
            m10[i] = random.nextInt(-10, 10 + 1);
            if (m10[i] == 0) {
                sum++;
            }
        }

        System.out.print(sum);

//Задание 11
//Заполнить массив из 15 случайных чисел от -60 до 60 и найти максимальный элемент.

        System.out.println("\n\n 11");

        max = 0;
        size = 15;
        int[] m11 = new int[size];
        max = m11[0];
        for (int i = 0; i < m11.length; i++) {
            m11[i] = random.nextInt(-60, 60 + 1);
            if (m11[i] > max) {
                max = m11[i];
            }
        }

        System.out.print("max: " + max);

//Задание 12
//Создать массив из 17 случайных чисел от -70 до 70 и найти минимальный элемент.

        System.out.println("\n\n 12");

        min = 0;
        size = 17;
        int[] m12 = new int[size];
        max = m12[0];
        for (int i = 0; i < m12.length; i++) {
            m12[i] = random.nextInt(-70, 70 + 1);
            if (m12[i] < min) {
                min = m12[i];
            }
        }

        System.out.print("min: " + min);

//## УРОВЕНЬ 3: СРЕДНИЕ (Операции с массивом)

//Задание 13
//Заполнить массив из 12 случайных чисел от -20 до 20 и вывести массив в обратном порядке (задом наперед).
        System.out.println("\n\n 13");

        size = 12;
        int[] m13 = new int[size];
        for (int i = 0; i < m13.length; i++) {
            m13[i] = random.nextInt(-20, 20 + 1);
            System.out.print(m13[i] + " ");
        }
        System.out.println();

        for (int i = size- 1; i >= 0; i--) {
            System.out.print(m13[i] + " ");
        }

//Задание 14
//Создать массив из 15 случайных чисел от -25 до 25 и вывести только положительные элементы.

        System.out.println("\n\n 14");


        size = 15;
        int[] m14 = new int[size];
        for (int i = 0; i < m14.length; i++) {
            m14[i] = random.nextInt(-25, 25 + 1);
            if (m14[i] > 0) {
                System.out.print(m14[i] + " ");
            }
        }

//Задание 15
//Заполнить массив из 16 случайных чисел от -35 до 35 и вывести только отрицательные элементы.
        System.out.println("\n\n 15");

        size = 16;
        int[] m15 = new int[size];
        for (int i = 0; i < m15.length; i++) {
            m15[i] = random.nextInt(-25, 25 + 1);
            if (m15[i] < 0) {
                System.out.print(m15[i] + " ");
            }
        }


//Задание 16
//Создать массив из 14 случайных чисел от -20 до 20 и вывести только четные элементы.
        System.out.println("\n\n 16");

        size = 14;
        int[] m16 = new int[size];
        for (int i = 0; i < m16.length; i++) {
            m16[i] = random.nextInt(-20, 20 + 1);
            if (m16[i] % 2 == 0) {
                System.out.print(m16[i] + " ");
            }
        }

//Задание 17
//Заполнить массив из 12 случайных чисел от -30 до 30 и найти индекс максимального элемента.

        System.out.println("\n\n 17");

        max = 0;
        size = 12;
        int[] m17 = new int[size];
        max = m17[0];
        for (int i = 0; i < m17.length; i++) {
            m17[i] = random.nextInt(-30, 30 + 1);
            if (m17[i] > max) {
                max = i;
            }
        }
        System.out.print(max);

//Задание 18
//Создать массив из 13 случайных чисел от -40 до 40 и найти индекс минимального элемента.

        System.out.println("\n\n 18");

        counter = 0;
        min = 0;
        size = 13;
        int[] m18 = new int[size];
        min = m18[0];
        for (int i = 0; i < m18.length; i++) {
            m18[i] = random.nextInt(-30, 30 + 1);
        }

        for (int i = 0; i < m18.length; i++) {
            if (m18[i] < min) {
                min = m18[i];
                counter = i;
            }
        }
        System.out.print(counter);


//Задание 19
//Заполнить массив из 20 случайных чисел от -45 до 45 и найти среднее арифметическое всех элементов.

        System.out.println("\n\n 19");

        counter = 0;
        size = 20;
        int[] m19 = new int[size];
        for (int i = 0; i < m19.length; i++) {
            m19[i] = random.nextInt(-45, 45 + 1);
            counter = counter + m19[i];
        }
        System.out.print(counter / 20.0);

//Задание 20
//Создать массив из 11 случайных чисел от -30 до 30 и заменить все отрицательные элементы на их модули (абсолютные значения).
        System.out.println("\n\n 20");

        size = 11;
        int[] m20 = new int[size];
        for (int i = 0; i < m20.length; i++) {
            m20[i] = random.nextInt(-30, 30 + 1);
            if (m20[i] < 0) {
                m20[i] = -m20[i];
            }
            System.out.print(m20[i] + " ");

        }

//## УРОВЕНЬ 4: СЛОЖНЕЕ (Комбинированные операции)

//Задание 21
//Заполнить массив из 18 случайных чисел от -50 до 50 и посчитать отдельно сумму положительных элементов и сумму отрицательных элементов.
        System.out.println("\n\n 21");

        negative = 0;
        positive = 0;
        size = 18;
        int[] m21 = new int[size];
        for (int i = 0; i < m21.length; i++) {
            m21[i] = random.nextInt(-50, 50);
            if (m21[i] < 0) {
                negative = negative + m21[i];
            } else {
                positive = positive + m21[i];
            }
        }
        System.out.print("positive sum: " + positive + ", negative sum: " + negative);

//Задание 22
//Создать массив из 22 случайных чисел от -80 до 80 и найти разницу между максимальным и минимальным элементом.
        System.out.println("\n\n 22");
        size = 22;
        int[] m22 = new int[size];
        min = m22[0];
        max = m22[0];

        for (int i = 0; i < m22.length; i++) {
            m22[i] = random.nextInt(-80, 80 + 1);
            if (m22[i] < 0 && m22[i] < min) {
                min = m22[i];
            }
            if (m22[i] > 0 && m22[i] > max) {
                max = m22[i];
            }
        }
        System.out.print(max - min);

//Задание 23
//Заполнить массив из 8 случайных чисел от -5 до 5 и найти произведение всех элементов массива.

        System.out.println("\n\n 23");

        counter = 0;
        size = 4;
        int[] m23 = new int[size];
        for (int i = 0; i < m23.length; i++) {
            m23[i] = random.nextInt(-5, 5 + 1);
            counter = counter + m23[i];
        }
        System.out.print(counter);

//Задание 24
//Создать массив из 15 случайных чисел от -40 до 40, найти среднее арифметическое и посчитать, сколько элементов больше среднего значения.

        System.out.println("\n\n 24");

        max = 0;
        counter = 0;
        size = 15;
        int[] m24 = new int[size];
        for (int i = 0; i < m24.length; i++) {
            m24[i] = random.nextInt(-25, 25 + 1);
            max = max + m24[i];
        }

        int average = max / size;
        for (int i = 0; i < m24.length; i++) {
            if (m24[i] > average) {
                counter++;
            }
        }

        System.out.println(average + " average");
        System.out.println("Элементов больше среднего значения: " + counter);
//Задание 25
//Заполнить массив из 20 случайных чисел от -50 до 50 и найти второй максимальный элемент (второй по величине).


        System.out.println("\n 25");

        size = 10;
        int[] m25 = new int[size];
        min = m25[0];
        max = m25[0];

        for (int i = 0; i < m25.length; i++) {
            m25[i] = random.nextInt(-50, 50 + 1);
            if (m25[i] > max) {
                max = m25[i];
            }
        }

        for (int i = 0; i < m25.length; i++) {
            if (m25[i] > min && m25[i] < max){
                min = m25[i];
            }
        }

        System.out.println(min + " min");
        System.out.println(max + " max");


//Задание 26
//Создать массив из 16 случайных чисел от -30 до 30 и найти сумму элементов, которые стоят на четных позициях (индексы 0, 2, 4, 6...).

        System.out.println("\n 26");

        counter = 0;
        size = 16;
        int[] m26 = new int[size];
        for (int i = 0; i < m26.length; i++) {
            m26[i] = random.nextInt(-30, 30 + 1);
            if (i % 2 == 0) {
                counter = counter + m26[i];
            }
        }
        System.out.println(counter);

//Задание 27
//Заполнить массив из 25 случайных чисел от -50 до 50 и подсчитать, сколько элементов находится в диапазоне от -10 до 10 (включительно).

        System.out.println("\n 27");

        counter = 0;
        size = 25;
        int[] m27 = new int[size];
        for (int i = 0; i < m27.length; i++) {
            m27[i] = random.nextInt(-50, 50 + 1);
            if (m27[i] <= 10 && m27[i] >= -10) {
                counter++;
            }
        }
        System.out.println(counter);


//Задание 28
//Создать массив из 18 случайных чисел от -20 до 20, найти максимальный элемент и вывести все индексы, на которых он встречается.

        System.out.println("\n\n 28");

        size = 18;
        int[] m28 = new int[size];
        max = m28[0];

        for (int i = 0; i < m28.length; i++) {
            m28[i] = random.nextInt(-20, 20 + 1);
            if (m28[i] > max) {
                max = m28[i];
            }
        }
        for (int i = 0; i < m28.length; i++) {
            if (m28[i] == max) {
                System.out.print(i + " ");
            }
        }

//Задание 29
//Заполнить массив из 12 случайных чисел от -10 до 10 и найти произведение только положительных элементов.

        System.out.println("\n\n 29");

        counter = 0;
        size = 12;
        int[] m29 = new int[size];
        for (int i = 0; i < m29.length; i++) {
            m29[i] = random.nextInt(-10, 10 + 1);
            if (m29[i] > 0) {
                if (counter == 0) {
                    counter = m29[i];
                }
                counter = counter * m29[i];
            }
        }
        System.out.println(counter);


//Задание 30
//Создать массив из 20 случайных чисел от -30 до 30 и найти самую длинную последовательность идущих подряд положительных чисел (сколько положительных чисел подряд максимум).

        System.out.println("\n 30");

        max = 0;
        counter = 0;
        size = 20;
        int[] m30 = new int[size];
        for (int i = 0; i < m30.length; i++) {
            m30[i] = random.nextInt(-15, 15 + 1);
            if (i == 0) {
                continue;
            }
            if (m30[i] > 0) {
                if (m30[i] - m30[i - 1] == 1) {
                    counter++;
                } else {
                    if (max < counter) {
                        max = counter;
                    }
                    counter = 0;
                }
            } else {
                if (max < counter) {
                    max = counter;
                }
                counter = 0;
            }
        }
        System.out.println(max);

//## 📝 Примечания:
//- Все задания предполагают заполнение массива случайными числами
//- Диапазоны чисел указаны для каждого задания
//- Задания расположены от простых к сложным
//- Решения НЕ включены - только условия задач

    }
}