//import java.util.Arrays;
//
////TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
//// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
//public class Main {
//    public static void main(String[] args) {
//
//        Arrays.asList(1, 2, 3, 4, 5, 6, 7, 8, 9, 0);
//
//    }
//}

public class Main {
    public static void main(String[] args) {
        System.out.println("//1");

        Runnable greeting = () -> {
            System.out.println("Hello! I work as a single stream!");
            System.out.println("Name of Stream: " + Thread.currentThread().getName());
        };
        Thread thread = new Thread(greeting);
        thread.start();
        System.out.println("Main stream is ended");

        System.out.println("//2");

        for (int num = 1; num <= 3; num++) {
            final int studentNum = num;
            Thread student = new Thread(() -> {
                System.out.println("Student " + studentNum + " start solve an exercise");
                System.out.println("Student " + studentNum + " solving...");
                try {
                    Thread.sleep(2000);
                } catch (Exception e) {
                    System.out.println("Error happened");;
                }
                System.out.println("Student " + studentNum + " finish solve an exercise");
            });
            student.start();
        }
    }
}

/*

Задача 1: Приветствие в отдельном потоке 👋
Условие:
Создай поток, который выводит в консоль:
Привет! Я работаю в отдельном потоке!
        Имя потока: [имя потока]
Требования:

Используй любой способ создания потока (extends Thread или Runnable или лямбда)
Запусти поток
В главном потоке выведи: "Главный поток завершён"

Ожидаемый вывод:
Главный поток завершён
Привет! Я работаю в отдельном потоке!
        Имя потока: Thread-0
(порядок может быть разным)

Задача 2: Три студента решают задачи 👨‍🎓👩‍🎓👨‍🎓
Условие:
Создай 3 потока, каждый поток представляет студента:

Студент 1
Студент 2
Студент 3

Каждый студент должен вывести в консоль:
Студент [номер] начал решать задачу
Студент [номер] решает... (подожди 2 секунды)
Студент [номер] закончил решать задачу
Требования:

Создай 3 потока
Используй Thread.sleep(2000) для имитации решения задачи
Запусти все 3 потока

Ожидаемый вывод (порядок может быть разным):
Студент 1 начал решать задачу
Студент 2 начал решать задачу
Студент 3 начал решать задачу
Студент 1 решает...
Студент 2 решает...
Студент 3 решает...
Студент 1 закончил решать задачу
Студент 2 закончил решать задачу
Студент 3 закончил решать задачу

Задача 3: Обратный отсчёт ⏱️
Условие:
Создай поток, который делает обратный отсчёт от 5 до 1, затем выводит "Старт!".
        Между каждым числом должна быть задержка 1 секунда.
        Требования:

Создай 1 поток
Используй цикл for от 5 до 1
Используй Thread.sleep(1000) для задержки
После отсчёта выведи "Старт!"

Ожидаемый вывод:
5
(пауза 1 секунда)
4
(пауза 1 секунда)
3
(пауза 1 секунда)
2
(пауза 1 секунда)
1
(пауза 1 секунда)
Старт!

 */