//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {
    public static void main(String[] args) {

    }
}


/*

// 1 - Start
        // 2 - Подсказки (off)
        // 3 - Попытки (off)
        // 4 - Диапазон (0-100)


        //1 Человек-Компютер
        //2 Компютер-Человек

        //1 Человек-Компютер
        //Введите имя : Фарид
        //Фарид загадай число : 66

        //Компютер угадывает число : 10

        //1 - Больше
        //2 - Меньше

        //Ответ : 1

        //Компютер угадывает число : 70

        //1 - Больше
        //2 - Меньше

        //Ответ : 2

        //Компютер угадывает число : 66

        //Урра компютер угадал число с 5 попыток


        /// ///////////////////////////////////////////////////////////////////////////////////////////////
        //Uqaday

        //1 Человек-Компютер
        //2 Компютер-Человек

        //1 Человек-Компютер
        //Введите имя : Фарид
        //Фарид загадай число : 66

        //Компютер угадывает число : 10

        //1 - Больше
        //2 - Меньше

        //Ответ : 1

        //Компютер угадывает число : 70

        //1 - Больше
        //2 - Меньше

        //Ответ : 2

        //Компютер угадывает число : 66

        //Урра компютер угадал число с 5 попыток


        /// ///////////////////////////////////////////////////////////////////////////////////////////////


        //2 Компютер-Человек
        //Введите имя : Фарид
        //Фарид компютер загадал число : x . Постарайтесь найти его!  (x = 33)

        //Фарид введи число : 10
        //Больше

        //Фарид введи число : 40
        //Меньше

        //Фарид введи число : 33


        //Урра Фарид угадал число с 3 попыток


        /// ///////////////////////////////////////////////////////////////////////////////////////////

        //***

        // 1 - Start
        // 2 - Подсказки (off)
        // 3 - Попытки (off)
        // 4 - Диапазон (0-100)
 */