
public class Main {
    public static void main(String[] args) {

        //1. Четные числа
        //Напишите программу, которая считывает число N и выводит все четные числа от 1 до N.

        System.out.print("Enter positive number: ");

        //2. Не четные числа
        //Напишите программу, которая считывает число N и выводит все не четные числа от 1 до N.

        //3. Количество не четных чисел
        //Напишите программу, которая считывает число N и выводит Количество не четных числел от 1 до N.

        //4. Количество четных чисел
        //Напишите программу, которая считывает число N и выводит Количество четных числел от 1 до N.

        //5. Сумма положительных
        //Программа считывает N-N чисел (Где начало и конец вводит пользователь). Найдите сумму только положительных чисел.

        //6. Сумма отрицательных
        //Программа считывает N-N чисел (Где начало и конец вводит пользователь). Найдите сумму только отрицательных чисел.
        //
        //7. Таблица умножения
        //Считайте число N и выведите таблицу умножения для этого числа (от 1 до 10).

        //8. Сумма положительных
        //Программа считывает N-N чисел (Где начало и конец вводит пользователь). Найдите количество
        //-положительных
        //-отрицательных
        //-четных
        //-не четных
        //-числа которые деляться на 3 и на 4 без остатка
        //-числа которые деляться на 4 и на 5 без остатка
        //-числа которые деляться на 2 и на 7 без остатка
        //-числа которые деляться на 3 или на 4 без остатка
        //-числа которые деляться на 5 или на 7 без остатка

    }
}