public class Main {
    public static void main(String[] args) {

//        Задание 1
//        Написать метод, который создает массив из N случайных чисел в диапазоне от min до max и возвращает этот массив.
//
//        Задание 2
//        Написать метод, который принимает массив и выводит все его элементы на экран в одну строку через пробел.
//
//        Задание 3
//        Написать метод, который принимает массив и возвращает сумму всех его элементов.
//
//        Задание 4
//        Написать метод, который принимает массив и возвращает количество положительных элементов в нем.
//
//                Задание 5
//        Написать метод, который принимает массив и возвращает максимальный элемент.
//
//        Задание 6
//        Написать метод, который принимает массив и возвращает минимальный элемент.
//
//        Задание 7
//        Написать метод, который принимает массив и возвращает среднее арифметическое всех элементов.

//        Задание 8
//        Написать метод, который принимает массив и возвращает количество четных чисел в нем.
//
//                Задание 9
//        Написать метод, который принимает массив и возвращает индекс максимального элемента.
//
//                Задание 10
//        Написать метод, который принимает массив и выводит только положительные элементы на экран.
//
//                Задание 11
//        Написать метод, который принимает массив и возвращает новый массив в обратном порядке.
//
//                Задание 12
//        Написать метод, который принимает массив и число, возвращает количество элементов равных этому числу.
//
//                Задание 13
//        Написать метод, который принимает массив и заменяет все отрицательные элементы на нули.
//
//                Задание 14
//        Написать метод, который принимает два массива и возвращает true, если их суммы элементов равны, иначе false.
//
//                Задание 15
//        Написать метод, который принимает массив и возвращает разницу между максимальным и минимальным элементом.

        }
    }
